victorzhengg/nrf5_sdk_17_1_0/examples/ble_peripheral/ble_app_blinky/main.c
/**
 * Copyright (c) 2015 - 2021, Nordic Semiconductor ASA
 *
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted provided that the following conditions are met:
 *
 * 1. Redistributions of source code must retain the above copyright notice, this
 *    list of conditions and the following disclaimer.
 *
 * 2. Redistributions in binary form, except as embedded into a Nordic
 *    Semiconductor ASA integrated circuit in a product or a software update for
 *    such product, must reproduce the above copyright notice, this list of
 *    conditions and the following disclaimer in the documentation and/or other
 *    materials provided with the distribution.
 *
 * 3. Neither the name of Nordic Semiconductor ASA nor the names of its
 *    contributors may be used to endorse or promote products derived from this
 *    software without specific prior written permission.
 *
 * 4. This software, with or without modification, must only be used with a
 *    Nordic Semiconductor ASA integrated circuit.
 *
 * 5. Any software provided in binary form under this license must not be reverse
 *    engineered, decompiled, modified and/or disassembled.
 *
 * THIS SOFTWARE IS PROVIDED BY NORDIC SEMICONDUCTOR ASA "AS IS" AND ANY EXPRESS
 * OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES
 * OF MERCHANTABILITY, NONINFRINGEMENT, AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL NORDIC SEMICONDUCTOR ASA OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE
 * GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION)
 * HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT
 * LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT
 * OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 *
 */
/**
 * @brief Blinky Sample Application main file.
 *
 * This file contains the source code for a sample server application using the LED Button service.
 */

#include <stdint.h>
#include <string.h>
#include "nordic_common.h"
#include "nrf.h"
#include "app_error.h"
#include "ble.h"
#include "ble_err.h"
#include "ble_hci.h"
#include "ble_srv_common.h"
#include "ble_advdata.h"
#include "ble_conn_params.h"
#include "nrf_sdh.h"
#include "nrf_sdh_ble.h"
#include "boards.h"
#include "app_timer.h"
#include "app_button.h"
#include "ble_lbs.h"
#include "nrf_ble_gatt.h"
#include "nrf_ble_qwr.h"
#include "nrf_pwr_mgmt.h"
#include <nrf_delay.h>


/*-----------------------------------------------------------------------------*/
/*victor add*/
#include "nrf_drv_pwm.h"
#include "nrf_drv_ppi.h"
#include "nrf_drv_timer.h"
#include "nrf_egu.h"

#define PWM0_OUT0                 3 
#define PWM0_OUT1                 4 
#define PWM0_OUT2                 26 
#define PWM0_OUT3                 27 

#define PWM1_OUT0                 28 
#define PWM1_OUT1                 29 
#define PWM1_OUT2                 30 
#define PWM1_OUT3                 31 


#define PWM_SEQ_LENGTH                  10
#define TRIGER_DELAY_PWM0_PWM1          200
#define PWM_PERIOD                      4000
#define PWM_INVERT_FLAG                 0x8000 


static nrf_drv_pwm_t m_pwm0 = NRF_DRV_PWM_INSTANCE(0);
static nrf_drv_pwm_t m_pwm1 = NRF_DRV_PWM_INSTANCE(1);

static nrf_pwm_values_individual_t m_pwm0_seq0_values[PWM_SEQ_LENGTH];
static nrf_pwm_sequence_t const    m_pwm0_seq0 =
{
    .values.p_individual = m_pwm0_seq0_values,
    .length              = NRF_PWM_VALUES_LENGTH(m_pwm0_seq0_values),
    .repeats             = 0,
    .end_delay           = 0
};

static nrf_pwm_values_individual_t m_pwm0_seq1_values[PWM_SEQ_LENGTH];
static nrf_pwm_sequence_t const    m_pwm0_seq1 =
{
    .values.p_individual = m_pwm0_seq1_values,
    .length              = NRF_PWM_VALUES_LENGTH(m_pwm0_seq1_values),
    .repeats             = 0,
    .end_delay           = 0
};


static nrf_pwm_values_individual_t m_pwm1_seq0_values[PWM_SEQ_LENGTH];
static nrf_pwm_sequence_t const    m_pwm1_seq0 =
{
    .values.p_individual = m_pwm1_seq0_values,
    .length              = NRF_PWM_VALUES_LENGTH(m_pwm1_seq0_values),
    .repeats             = 0,
    .end_delay           = 0
};

static nrf_pwm_values_individual_t m_pwm1_seq1_values[PWM_SEQ_LENGTH];
static nrf_pwm_sequence_t const    m_pwm1_seq1 =
{
    .values.p_individual = m_pwm1_seq1_values,
    .length              = NRF_PWM_VALUES_LENGTH(m_pwm1_seq1_values),
    .repeats             = 0,
    .end_delay           = 0
};


static nrf_ppi_channel_t m_ppi_channel;
static nrf_ppi_channel_t m_ppi_channel_stop;
static nrf_ppi_channel_t m_ppi_channel_stop2;
static nrf_ppi_channel_t m_ppi_channel_stop3;

static const nrf_drv_timer_t m_timer0 = NRF_DRV_TIMER_INSTANCE(1);


/*-----------------------------------------------------------------------------*/


#include "nrf_log.h"
#include "nrf_log_ctrl.h"
#include "nrf_log_default_backends.h"


#define ADVERTISING_LED                 BSP_BOARD_LED_0                         /**< Is on when device is advertising. */
#define CONNECTED_LED                   BSP_BOARD_LED_1                         /**< Is on when device has connected. */
#define LEDBUTTON_LED                   BSP_BOARD_LED_2                         /**< LED to be toggled with the help of the LED Button Service. */
#define LEDBUTTON_BUTTON                BSP_BUTTON_0                            /**< Button that will trigger the notification event with the LED Button Service */

#define DEVICE_NAME                     "Nordic_Blinky"                         /**< Name of device. Will be included in the advertising data. */

#define APP_BLE_OBSERVER_PRIO           3                                       /**< Application's BLE observer priority. You shouldn't need to modify this value. */
#define APP_BLE_CONN_CFG_TAG            1                                       /**< A tag identifying the SoftDevice BLE configuration. */

#define APP_ADV_INTERVAL                64                                      /**< The advertising interval (in units of 0.625 ms; this value corresponds to 40 ms). */
#define APP_ADV_DURATION                BLE_GAP_ADV_TIMEOUT_GENERAL_UNLIMITED   /**< The advertising time-out (in units of seconds). When set to 0, we will never time out. */


#define MIN_CONN_INTERVAL               MSEC_TO_UNITS(100, UNIT_1_25_MS)        /**< Minimum acceptable connection interval (0.5 seconds). */
#define MAX_CONN_INTERVAL               MSEC_TO_UNITS(200, UNIT_1_25_MS)        /**< Maximum acceptable connection interval (1 second). */
#define SLAVE_LATENCY                   0                                       /**< Slave latency. */
#define CONN_SUP_TIMEOUT                MSEC_TO_UNITS(4000, UNIT_10_MS)         /**< Connection supervisory time-out (4 seconds). */

#define FIRST_CONN_PARAMS_UPDATE_DELAY  APP_TIMER_TICKS(20000)                  /**< Time from initiating event (connect or start of notification) to first time sd_ble_gap_conn_param_update is called (15 seconds). */
#define NEXT_CONN_PARAMS_UPDATE_DELAY   APP_TIMER_TICKS(5000)                   /**< Time between each call to sd_ble_gap_conn_param_update after the first call (5 seconds). */
#define MAX_CONN_PARAMS_UPDATE_COUNT    3                                       /**< Number of attempts before giving up the connection parameter negotiation. */

#define BUTTON_DETECTION_DELAY          APP_TIMER_TICKS(50)                     /**< Delay from a GPIOTE event until a button is reported as pushed (in number of timer ticks). */

#define DEAD_BEEF                       0xDEADBEEF                              /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */


