victorzhengg/nrf5_sdk_17_1_0/examples/ble_peripheral/ble_app_blinky/main.c
    switch (pin_no)
    {
        case LEDBUTTON_BUTTON:
							if(button_action == 0)
							{
								 // start the PWM0 and PWM1
								 nrf_egu_task_trigger(NRF_EGU0, NRF_EGU_TASK_TRIGGER0);
							}
            break;

        default:
            APP_ERROR_HANDLER(pin_no);
            break;
    }
}


/**@brief Function for initializing the button handler module.
 */
static void buttons_init(void)
{
    ret_code_t err_code;

    //The array must be static because a pointer to it will be saved in the button handler module.
    static app_button_cfg_t buttons[] =
    {
        {LEDBUTTON_BUTTON, false, BUTTON_PULL, button_event_handler}
    };

    err_code = app_button_init(buttons, ARRAY_SIZE(buttons),
                               BUTTON_DETECTION_DELAY);
    APP_ERROR_CHECK(err_code);
}


static void log_init(void)
{
    ret_code_t err_code = NRF_LOG_INIT(NULL);
    APP_ERROR_CHECK(err_code);

    NRF_LOG_DEFAULT_BACKENDS_INIT();
}


/**@brief Function for initializing power management.
 */
static void power_management_init(void)
{
    ret_code_t err_code;
    err_code = nrf_pwr_mgmt_init();
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    if (NRF_LOG_PROCESS() == false)
    {
        //nrf_pwr_mgmt_run();
    }
}

static uint16_t debug_cnt = 0;
#define DEBUG_THRESHHOLD   2

#define PWM_DUTY_STEP   200
static uint16_t m_pwm_duty = 200;

static uint16_t loop_num = 2;

static void pwm0_handler(nrf_drv_pwm_evt_type_t event_type)
{
		uint16_t index;
	
    if (event_type == NRF_DRV_PWM_EVT_END_SEQ0)
    {
				nrf_gpio_pin_set(19);
/*			
			  m_pwm_duty = m_pwm_duty + PWM_DUTY_STEP;
				for(index=0;index<PWM_SEQ_LENGTH;index++)
				{
						m_pwm0_seq1_values[index].channel_0 = m_pwm_duty + PWM_INVERT_FLAG;
						m_pwm0_seq1_values[index].channel_1 = m_pwm_duty + PWM_INVERT_FLAG;
						m_pwm0_seq1_values[index].channel_2 = m_pwm_duty + PWM_INVERT_FLAG;
						m_pwm0_seq1_values[index].channel_3 = m_pwm_duty + PWM_INVERT_FLAG;
				}
				
				nrf_pwm_sequence_set(m_pwm0.p_registers, 1, &m_pwm0_seq1);			
*/			
				nrf_gpio_pin_clear(19);
    }
		else if (event_type == NRF_DRV_PWM_EVT_END_SEQ1)
		{

				nrf_gpio_pin_set(19);
/*
			  m_pwm_duty = m_pwm_duty + PWM_DUTY_STEP;
				for(index=0;index<PWM_SEQ_LENGTH;index++)
				{
						m_pwm0_seq0_values[index].channel_0 = m_pwm_duty + PWM_INVERT_FLAG;
						m_pwm0_seq0_values[index].channel_1 = m_pwm_duty + PWM_INVERT_FLAG;
						m_pwm0_seq0_values[index].channel_2 = m_pwm_duty + PWM_INVERT_FLAG;
						m_pwm0_seq0_values[index].channel_3 = m_pwm_duty + PWM_INVERT_FLAG;
				}
				
				nrf_pwm_sequence_set(m_pwm0.p_registers, 0, &m_pwm0_seq0);		
*/			
				nrf_gpio_pin_clear(19);			
		}
		else if (event_type == NRF_DRV_PWM_EVT_STOPPED)
		{
		}
		
}

static void pwm1_handler(nrf_drv_pwm_evt_type_t event_type)
{
		uint16_t index;
	
    if (event_type == NRF_DRV_PWM_EVT_END_SEQ0)
    {
				nrf_gpio_pin_set(20);
/*			
				for(index=0;index<PWM_SEQ_LENGTH;index++)
				{
						m_pwm1_seq1_values[index].channel_0 = m_pwm_duty;
						m_pwm1_seq1_values[index].channel_1 = m_pwm_duty;
						m_pwm1_seq1_values[index].channel_2 = m_pwm_duty;
						m_pwm1_seq1_values[index].channel_3 = m_pwm_duty;
				}


				nrf_pwm_sequence_set(m_pwm1.p_registers, 1, &m_pwm1_seq1);
*/			
				nrf_gpio_pin_clear(20);
    }
		else if (event_type == NRF_DRV_PWM_EVT_END_SEQ1)
		{
				nrf_gpio_pin_set(20);
/*			
				for(index=0;index<PWM_SEQ_LENGTH;index++)
				{
						m_pwm1_seq0_values[index].channel_0 = m_pwm_duty;
						m_pwm1_seq0_values[index].channel_1 = m_pwm_duty;
						m_pwm1_seq0_values[index].channel_2 = m_pwm_duty;
						m_pwm1_seq0_values[index].channel_3 = m_pwm_duty;
				}
				nrf_pwm_sequence_set(m_pwm1.p_registers, 0, &m_pwm1_seq0);
*/			
				nrf_gpio_pin_clear(20);			
		}
		else if (event_type == NRF_DRV_PWM_EVT_STOPPED)
		{
		}		
}

static void pwm_init(void)
{
	  int index;
		int err_code;
		uint32_t int_mask;
		uint32_t shorts_mask;
	
    NRF_LOG_INFO("pwm_init");

																	/* pwm0 config*/
    /*-----------------------------------------------------------------------------*/
    nrf_drv_pwm_config_t const config0 =
    {
        .output_pins =
        {
            PWM0_OUT0, // channel 0
            PWM0_OUT1, // channel 1
            PWM0_OUT2, // channel 2
            PWM0_OUT3  // channel 3
        },
        .irq_priority = APP_IRQ_PRIORITY_LOWEST,
        .base_clock   = NRF_PWM_CLK_16MHz,
        .count_mode   = NRF_PWM_MODE_UP,
        .top_value    = PWM_PERIOD,            //250us period
        .load_mode    = NRF_PWM_LOAD_INDIVIDUAL,
        .step_mode    = NRF_PWM_STEP_AUTO
    };
    APP_ERROR_CHECK(nrf_drv_pwm_init(&m_pwm0, &config0, pwm0_handler));
		for(index=0;index<PWM_SEQ_LENGTH;index++)
		{
				m_pwm0_seq0_values[index].channel_0 = (index+1)*100 + PWM_INVERT_FLAG;
				m_pwm0_seq0_values[index].channel_1 = (index+1)*100 + PWM_INVERT_FLAG;
				m_pwm0_seq0_values[index].channel_2 = (index+1)*100 + PWM_INVERT_FLAG;
				m_pwm0_seq0_values[index].channel_3 = (index+1)*100 + PWM_INVERT_FLAG;

				m_pwm0_seq1_values[index].channel_0 = (index+1)*100 +1000 + PWM_INVERT_FLAG;
				m_pwm0_seq1_values[index].channel_1 = (index+1)*100 +1000 + PWM_INVERT_FLAG;
				m_pwm0_seq1_values[index].channel_2 = (index+1)*100 +1000 + PWM_INVERT_FLAG;
				m_pwm0_seq1_values[index].channel_3 = (index+1)*100 +1000 + PWM_INVERT_FLAG;			
		}
		
		/* set the seq0*/
		nrf_pwm_sequence_set(m_pwm0.p_registers, 0, &m_pwm0_seq0);
		nrf_pwm_sequence_set(m_pwm0.p_registers, 1, &m_pwm0_seq1);
		nrf_pwm_loop_set(m_pwm0.p_registers, loop_num);
		
		/* set short between seq0_end and stop*/
		shorts_mask = NRF_PWM_SHORT_LOOPSDONE_STOP_MASK;
		nrf_pwm_shorts_set(m_pwm0.p_registers, shorts_mask);
		
		/* enable the interrupt stoped*/
		int_mask = NRF_PWM_INT_STOPPED_MASK;
		// The workaround for nRF52 Anomaly 109 "protects" DMA transfers
		int_mask |= NRF_PWM_INT_SEQEND0_MASK | NRF_PWM_INT_SEQEND1_MASK;
		nrf_pwm_int_set(m_pwm0.p_registers, int_mask);
		nrf_pwm_event_clear(m_pwm0.p_registers, NRF_PWM_EVENT_SEQEND0 | NRF_PWM_EVENT_STOPPED);
		
