victorzhengg/nrf5_sdk_17_1_0/examples/ble_peripheral/ble_app_blinky/main.c
		nrfx_pwm_set_cb_flag(&m_pwm0, NRFX_PWM_FLAG_SIGNAL_END_SEQ0 | NRFX_PWM_FLAG_SIGNAL_END_SEQ1);

		
		
		                           /* pwm1 config*/
		/*-----------------------------------------------------------------------------*/
    nrf_drv_pwm_config_t const config1 =
    {
        .output_pins =
        {
            PWM1_OUT0, // channel 0
            PWM1_OUT1, // channel 1
            PWM1_OUT2, // channel 2
            PWM1_OUT3  // channel 3
        },
        .irq_priority = APP_IRQ_PRIORITY_LOWEST,
        .base_clock   = NRF_PWM_CLK_16MHz,
        .count_mode   = NRF_PWM_MODE_UP,
        .top_value    = PWM_PERIOD,            //250us period
        .load_mode    = NRF_PWM_LOAD_INDIVIDUAL,
        .step_mode    = NRF_PWM_STEP_AUTO
    };
    APP_ERROR_CHECK(nrf_drv_pwm_init(&m_pwm1, &config1, pwm1_handler));
		for(index=0;index<PWM_SEQ_LENGTH;index++)
		{
				m_pwm1_seq0_values[index].channel_0 = (index+1)*100;
				m_pwm1_seq0_values[index].channel_1 = (index+1)*100;
				m_pwm1_seq0_values[index].channel_2 = (index+1)*100;
				m_pwm1_seq0_values[index].channel_3 = (index+1)*100;

				m_pwm1_seq1_values[index].channel_0 = (index+1)*100 +1000;
				m_pwm1_seq1_values[index].channel_1 = (index+1)*100 +1000;
				m_pwm1_seq1_values[index].channel_2 = (index+1)*100 +1000;
				m_pwm1_seq1_values[index].channel_3 = (index+1)*100 +1000;						
		}
		/* set the seq0*/
		nrf_pwm_sequence_set(m_pwm1.p_registers, 0, &m_pwm1_seq0);
		nrf_pwm_sequence_set(m_pwm1.p_registers, 1, &m_pwm1_seq1);
		nrf_pwm_loop_set(m_pwm1.p_registers, loop_num);
		
		/* set short between seq0_end and stop*/
		shorts_mask = NRF_PWM_SHORT_LOOPSDONE_STOP_MASK;
		nrf_pwm_shorts_set(m_pwm1.p_registers, shorts_mask);
		
		/* enable the interrupt stoped*/
		int_mask = NRF_PWM_INT_STOPPED_MASK;
		// The workaround for nRF52 Anomaly 109 "protects" DMA transfers
		int_mask |= NRF_PWM_INT_SEQEND0_MASK | NRF_PWM_INT_SEQEND1_MASK;
		nrf_pwm_int_set(m_pwm1.p_registers, int_mask);
		nrf_pwm_event_clear(m_pwm1.p_registers, NRF_PWM_EVENT_SEQEND0 | NRF_PWM_EVENT_STOPPED);
		
		nrfx_pwm_set_cb_flag(&m_pwm1, NRFX_PWM_FLAG_SIGNAL_END_SEQ0 | NRFX_PWM_FLAG_SIGNAL_END_SEQ1);

		                           /* TIMER0*/
		/*-----------------------------------------------------------------------------*/		
    // Check TIMER0 configuration for details.
    nrf_drv_timer_config_t timer_cfg = NRF_DRV_TIMER_DEFAULT_CONFIG;
    timer_cfg.frequency = NRF_TIMER_FREQ_1MHz;
    err_code = nrf_drv_timer_init(&m_timer0, &timer_cfg, NULL);
    APP_ERROR_CHECK(err_code);

    nrf_drv_timer_extended_compare(&m_timer0,
                                   NRF_TIMER_CC_CHANNEL0,
                                   TRIGER_DELAY_PWM0_PWM1,
                                   NRF_TIMER_SHORT_COMPARE0_CLEAR_MASK | NRF_TIMER_SHORT_COMPARE0_STOP_MASK,
                                   false);		
		
		
		                           /* PPI synchronize*/
		/*-----------------------------------------------------------------------------*/
    err_code = nrf_drv_ppi_init();
    APP_ERROR_CHECK(err_code);

    /* PPI connect the EGU0 EVENT0 to the NRF_PWM_TASK_SEQSTART0 of PWM0 and PWM1
     * 
     */
    err_code = nrf_drv_ppi_channel_alloc(&m_ppi_channel);
    APP_ERROR_CHECK(err_code);
		
    err_code = nrf_drv_ppi_channel_assign(m_ppi_channel,
																					(uint32_t)nrf_egu_event_address_get(NRF_EGU0, 
																					                                    NRF_EGU_EVENT_TRIGGERED0),
                                          nrf_pwm_task_address_get(m_pwm0.p_registers,
                                                                         NRF_PWM_TASK_SEQSTART0));
    APP_ERROR_CHECK(err_code);

		err_code = nrf_drv_ppi_channel_fork_assign(m_ppi_channel,
		                                           nrf_pwm_task_address_get(m_pwm1.p_registers,
                                                                         NRF_PWM_TASK_SEQSTART0));
		
		
    // Enable both configured PPI channels
    err_code = nrf_drv_ppi_channel_enable(m_ppi_channel);
    APP_ERROR_CHECK(err_code);

}
/**@brief Function for application main entry.
 */
int main(void)
{
	  int err_code;
    // Initialize.
    log_init();
    leds_init();
    timers_init();
    buttons_init();
    power_management_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();
	
    /*victor add pwm init*/
		pwm_init();
		nrf_gpio_pin_clear(19);
		nrf_gpio_pin_clear(20);
    // Start execution.
    NRF_LOG_INFO("Blinky example started.");
    advertising_start();

		err_code = app_button_enable();
		APP_ERROR_CHECK(err_code);
						
    // Enter main loop.
    for (;;)
    {
        idle_state_handle();
    }
}


/**
 * @}
 */
